# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [2]:
path = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user'
users = pd.read_csv(path, delimiter='|')
users.head(2)

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043

### Step 4. Discover what is the mean age per occupation

In [4]:
users.groupby('occupation')['age'].agg('mean')

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [6]:
def

C:\Users\my-local\AppData\Local\Temp\ipykernel_24560\3226106501.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  110*(male_only.groupby('occupation').agg('sum'))/(users.groupby('occupation').agg('sum'))
C:\Users\my-local\AppData\Local\Temp\ipykernel_24560\3226106501.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  110*(male_only.groupby('occupation').agg('sum'))/(users.groupby('occupation').agg('sum'))

                  user_id         age
occupation
administrator   58.361874   57.425678
artist          61.159409   60.693970
doctor         110.000000  110.000000
educator        80.679728   81.969431
engineer       104.196703  107.337982
entertainment   86.046901   97.034221
executive      100.891668   98.280872
healthcare      24.267730   37.548872
homemaker       31.854241   11.096491
lawyer          95.449060   90.294785
librarian       52.265071   47.450980
marketing       67.161557   68.159509
none            40.810729   42.803347
other           77.015635   71.249655
programmer     100.559402  100.288198
retired         96.897507  101.279728
salesman        74.568109   89.182243
scientist       96.001110  101.515426
student         75.453073   78.357209
technician     102.320631  105.329609
writer          59.775855   61.866585

### Step 6. For each occupation, calculate the minimum and maximum ages

### Step 7. For each combination of occupation and gender, calculate the mean age

### Step 8.  For each occupation present the percentage of women and men